feat(docs): add correction on state machine docs
